app/controllers/plants_controller.rb

SELECT  "images".* FROM "images"  WHERE "images"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @image = Image.find(rand(1..Image.all.count)).url

SELECT  "images".* FROM "images"  WHERE "images"."id" = $1 LIMIT 1  [["id", 6]]
SELECT "plants".* FROM "plants"  WHERE "plants"."light_requirement" = 3 AND "plants"."water_requirement" = 3 AND ("plants"."max_height" BETWEEN 4 AND 20)
SELECT COUNT(*) FROM "plants"  WHERE "plants"."light_requirement" = 3 AND "plants"."water_requirement" = 1 AND ("plants"."max_height" BETWEEN 4 AND 20)
---
  def search
    @image = Image.find(rand(1..Image.all.count)).url
    @plants = Plant.where(light_requirement: params['plant']['light'], water_requirement: params['plant']['water'], max_height: plant_size(params['plant']['size'].to_i))

SELECT  "images".* FROM "images"  WHERE "images"."id" = $1 LIMIT 1  [["id", 14]]
SELECT  "plants".* FROM "plants"  WHERE "plants"."id" = $1 LIMIT 1  [["id", 5]]
---
  def show
    @image = Image.find(rand(1..Image.all.count)).url
    @plant = Plant.find(params[:id])